//

// Console.WriteLine("Привет нам");


// Console.WriteLine("Привет нам");


// Console.WriteLine("Привет нам");


// Console.WriteLine("Привет нам");
////////////////////////////////////////////////////////////////////////////////

// Тип 1 функций. Ничего и никуда (не принимает и не выдает).
//void - метод ничего не возвращает

// void SayLang()    // SayLang - имя метода
// {
//     Console.WriteLine("Привет нам");
// }
// SayLang(); //вызов метода

////////////////////////////////////////////////////////////////////////
// //Тип2 функции. 

// void SayLang(string name)    // SayLang - имя метода, задаем переменную текстовую name
// {
//     Console.WriteLine($"Привет {name}");
// }
// SayLang("Leonid"); //вызов метода

///////////////////////////////////

// Тип 3

int SayMax(int num1, int num2)
{
    if (num1 > num2)
    {
        return 
    }
}
    

SayLang("Leonid"); //вызов метода